---
type: PointCollection
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 7
tags: [revit-api, class]
---

# PointCollection

`Autodesk.Revit.DB.PointClouds.PointCollection` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < CloudPoint > GetEnumerator ()` |
| Method | GetPointBufferPointer | 2012 | `public IntPtr GetPointBufferPointer ()` |
| Method | GetPointIterator | 2012 | `public PointIterator GetPointIterator ()` |
| Property | Count | 2012 | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |